[
    {
        "createdAt": 1628682797740,
        "description": "Dire \"Titre !\" quand un collègue dis quelque chose sujet à interprétation qui pourrait être assimilé à un contenu NSFW.",
        "downvotes": 36,
        "id": "0001",
        "title": "Titre",
        "upvotes": 3000
    },
    {
        "createdAt": 1628638797740,
        "description": "Qui n’aime pas le bon pinard ?!  L’idée c’est de conjuguer de la data de base de données existantes (type Vivino) et des sites d’achat en ligne type https://fr.bazarchic.com/ qui font des ventes éclaires. En gros on définit nos préférences de vins / années /notes mini etc et on recoit les bonnes affaires de différents sites.",
        "downvotes": 12,
        "id": "0002",
        "title": "Wine Buyer",
        "upvotes": 335
    },
    {
        "createdAt": 1628627797740,
        "description": "[PITCH / BRAINSTORMING]\n\n        Ola les hackatheux !\n        Idée assez précise (trop ?) mais ouverte à la discussion pour l'enrichir autour des thèmes suivants :\n        Jeux Vidéo (Retro)\n        Générateur de Cohésion\n        Mise sur le Marché, why not ?\n        \n        On a rarement l'occasion de se confronter au développement de Jeu Vidéo au quotidien donc quelle meilleure occasion qu'un hackathon. Sans plus attendre voici l'idée : So High (provisoire)\n        \n        Le but du jeu est d'arriver à la plus haute altitude dans un temps donné (5/10/15min) en sautant d'obstacle en obstacle.\n        Une chute ? on redescendent et on repart de l'endroit où l'on est tombé.\n        Scrolling Vertical Infini\n        Mode Race : synchrone avec autant de participants qu'on le souhaite (attention aux collisions), début à une heure définie pour la durée définie : le vainqueur est celui qui arrive le plus haut. Génération aléatoire du niveau pour chaque nouvelles courses, pour toujours plus de nouveauté.\n        Mode Challenge : asynchrone avec autant de challenger qu'on le souhaite (pas de collision, fantôme de l'adversaire à l'ancienne), je fais mon run et je le partage, mes adversaires essaye d'aller plus haut que moi : le vainqueur est celui qui arrive le plus haut. Partage du niveau d'origine pour un défi donné.\n        Mode Training : solo avec replay à partager : pas de vainqueur mais une altitude atteinte à partager (classement ?)\n        \n        Features cohésion :\n        ajouter des amis\n        créer des équipes/clans/guildes\n        profil perso\n        partager ses replays Training\n        Challenger X personnes pendant Y jours\n        organiser une Race à l'heure T\n        liker un replay\n        classement Altitude Max\n        ... et toute autre truc fun\n        \n        Challenges Techniques :\n        Génération procédurale des niveaux / Pré-Génération aléatoire des niveaux mais qu'ils restent jouables\n        Gestion des collisions et Temps Réel\n        Gestions des replay\n        ... plein d'autres trucs\n        \n        Challenges Design :\n        Création de Ambiances/Thèmes\n        Transition Ambiances/Thèmes durant la course\n        Animation personnages et décors\n        UI et UX pour servir la cohésion et le fun\n        ... plein d'autres trucs\n        \n        Challenges Produit/MVP :\n        :warning: prioriser tout ça pour avoir un MVP pour Mai :warning:\n        Etude de marché utilisateurs\n        ... plein d'autres trucs\n        \n        Voilà voilà, à vous de me dire si ça vous intéresse (travail nocturne en async à prévoir :stuck_out_tongue:)",
        "downvotes": 6,
        "id": "0003",
        "title": "So High",
        "upvotes": 1259
    },
    {
        "createdAt": 1628638697740,
        "description": "J'ai une idée que je viens d'avoir qu'elle est bonne\nT'as des potes aux 4 coins de la France\nTu veux organiser un gros weekend avec eux\nTu sais pas où aller\n:épingle2: Grâce à nous, tu rentres l'adresse de tout le monde et l'app te sort le barycentre avec les trucs à faire dans le coin :parfait:",
        "downvotes": 32,
        "id": "0004",
        "title": "Salut :salut_main:",
        "upvotes": 66
    }
]
